MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP512GM710/mcu.h
#define _IPC24_PWM6IP1_POSITION                  0x0000000D
#define _IPC24_PWM6IP1_MASK                      0x00002000
#define _IPC24_PWM6IP1_LENGTH                    0x00000001

#define _IPC24_PWM6IP2_POSITION                  0x0000000E
#define _IPC24_PWM6IP2_MASK                      0x00004000
#define _IPC24_PWM6IP2_LENGTH                    0x00000001

#define _IPC35_ICDIP_POSITION                    0x00000008
#define _IPC35_ICDIP_MASK                        0x00000700
#define _IPC35_ICDIP_LENGTH                      0x00000003

#define _IPC35_JTAGIP_POSITION                   0x0000000C
#define _IPC35_JTAGIP_MASK                       0x00007000
#define _IPC35_JTAGIP_LENGTH                     0x00000003

#define _IPC35_ICDIP0_POSITION                   0x00000008
#define _IPC35_ICDIP0_MASK                       0x00000100
#define _IPC35_ICDIP0_LENGTH                     0x00000001

#define _IPC35_ICDIP1_POSITION                   0x00000009
#define _IPC35_ICDIP1_MASK                       0x00000200
#define _IPC35_ICDIP1_LENGTH                     0x00000001

#define _IPC35_ICDIP2_POSITION                   0x0000000A
#define _IPC35_ICDIP2_MASK                       0x00000400
#define _IPC35_ICDIP2_LENGTH                     0x00000001

#define _IPC35_JTAGIP0_POSITION                  0x0000000C
#define _IPC35_JTAGIP0_MASK                      0x00001000
#define _IPC35_JTAGIP0_LENGTH                    0x00000001

#define _IPC35_JTAGIP1_POSITION                  0x0000000D
#define _IPC35_JTAGIP1_MASK                      0x00002000
#define _IPC35_JTAGIP1_LENGTH                    0x00000001

#define _IPC35_JTAGIP2_POSITION                  0x0000000E
#define _IPC35_JTAGIP2_MASK                      0x00004000
#define _IPC35_JTAGIP2_LENGTH                    0x00000001

#define _IPC36_PTGSTEPIP_POSITION                0x00000004
#define _IPC36_PTGSTEPIP_MASK                    0x00000070
#define _IPC36_PTGSTEPIP_LENGTH                  0x00000003

#define _IPC36_PTGWDTIP_POSITION                 0x00000008
#define _IPC36_PTGWDTIP_MASK                     0x00000700
#define _IPC36_PTGWDTIP_LENGTH                   0x00000003

#define _IPC36_PTG0IP_POSITION                   0x0000000C
#define _IPC36_PTG0IP_MASK                       0x00007000
#define _IPC36_PTG0IP_LENGTH                     0x00000003

#define _IPC36_PTGSTEPIP0_POSITION               0x00000004
#define _IPC36_PTGSTEPIP0_MASK                   0x00000010
#define _IPC36_PTGSTEPIP0_LENGTH                 0x00000001

#define _IPC36_PTGSTEPIP1_POSITION               0x00000005
#define _IPC36_PTGSTEPIP1_MASK                   0x00000020
#define _IPC36_PTGSTEPIP1_LENGTH                 0x00000001

#define _IPC36_PTGSTEPIP2_POSITION               0x00000006
#define _IPC36_PTGSTEPIP2_MASK                   0x00000040
#define _IPC36_PTGSTEPIP2_LENGTH                 0x00000001

#define _IPC36_PTGWDTIP0_POSITION                0x00000008
#define _IPC36_PTGWDTIP0_MASK                    0x00000100
#define _IPC36_PTGWDTIP0_LENGTH                  0x00000001

#define _IPC36_PTGWDTIP1_POSITION                0x00000009
#define _IPC36_PTGWDTIP1_MASK                    0x00000200
#define _IPC36_PTGWDTIP1_LENGTH                  0x00000001

#define _IPC36_PTGWDTIP2_POSITION                0x0000000A
#define _IPC36_PTGWDTIP2_MASK                    0x00000400
#define _IPC36_PTGWDTIP2_LENGTH                  0x00000001

#define _IPC36_PTG0IP0_POSITION                  0x0000000C
#define _IPC36_PTG0IP0_MASK                      0x00001000
#define _IPC36_PTG0IP0_LENGTH                    0x00000001

#define _IPC36_PTG0IP1_POSITION                  0x0000000D
#define _IPC36_PTG0IP1_MASK                      0x00002000
#define _IPC36_PTG0IP1_LENGTH                    0x00000001

#define _IPC36_PTG0IP2_POSITION                  0x0000000E
#define _IPC36_PTG0IP2_MASK                      0x00004000
#define _IPC36_PTG0IP2_LENGTH                    0x00000001

#define _IPC37_PTG1IP_POSITION                   0x00000000
#define _IPC37_PTG1IP_MASK                       0x00000007
#define _IPC37_PTG1IP_LENGTH                     0x00000003

#define _IPC37_PTG2IP_POSITION                   0x00000004
#define _IPC37_PTG2IP_MASK                       0x00000070
#define _IPC37_PTG2IP_LENGTH                     0x00000003

#define _IPC37_PTG3IP_POSITION                   0x00000008
#define _IPC37_PTG3IP_MASK                       0x00000700
#define _IPC37_PTG3IP_LENGTH                     0x00000003

#define _IPC37_PTG1IP0_POSITION                  0x00000000
#define _IPC37_PTG1IP0_MASK                      0x00000001
#define _IPC37_PTG1IP0_LENGTH                    0x00000001

#define _IPC37_PTG1IP1_POSITION                  0x00000001
#define _IPC37_PTG1IP1_MASK                      0x00000002
#define _IPC37_PTG1IP1_LENGTH                    0x00000001

#define _IPC37_PTG1IP2_POSITION                  0x00000002
#define _IPC37_PTG1IP2_MASK                      0x00000004
#define _IPC37_PTG1IP2_LENGTH                    0x00000001

#define _IPC37_PTG2IP0_POSITION                  0x00000004
#define _IPC37_PTG2IP0_MASK                      0x00000010
#define _IPC37_PTG2IP0_LENGTH                    0x00000001

#define _IPC37_PTG2IP1_POSITION                  0x00000005
#define _IPC37_PTG2IP1_MASK                      0x00000020
#define _IPC37_PTG2IP1_LENGTH                    0x00000001

#define _IPC37_PTG2IP2_POSITION                  0x00000006
#define _IPC37_PTG2IP2_MASK                      0x00000040
#define _IPC37_PTG2IP2_LENGTH                    0x00000001

#define _IPC37_PTG3IP0_POSITION                  0x00000008
#define _IPC37_PTG3IP0_MASK                      0x00000100
#define _IPC37_PTG3IP0_LENGTH                    0x00000001

#define _IPC37_PTG3IP1_POSITION                  0x00000009
#define _IPC37_PTG3IP1_MASK                      0x00000200
#define _IPC37_PTG3IP1_LENGTH                    0x00000001

#define _IPC37_PTG3IP2_POSITION                  0x0000000A
#define _IPC37_PTG3IP2_MASK                      0x00000400
#define _IPC37_PTG3IP2_LENGTH                    0x00000001

#define _INTCON1_OSCFAIL_POSITION                0x00000001
#define _INTCON1_OSCFAIL_MASK                    0x00000002
#define _INTCON1_OSCFAIL_LENGTH                  0x00000001

#define _INTCON1_STKERR_POSITION                 0x00000002
#define _INTCON1_STKERR_MASK                     0x00000004
#define _INTCON1_STKERR_LENGTH                   0x00000001

#define _INTCON1_ADDRERR_POSITION                0x00000003
#define _INTCON1_ADDRERR_MASK                    0x00000008
#define _INTCON1_ADDRERR_LENGTH                  0x00000001

#define _INTCON1_MATHERR_POSITION                0x00000004
#define _INTCON1_MATHERR_MASK                    0x00000010
#define _INTCON1_MATHERR_LENGTH                  0x00000001

